<template>
    <main>

        <Header />

        <div class="main">

            <div class="leftSide">
                <h1>Правила пользования сайтом</h1>
                <h2>1.Общие условия</h2>
                <ul>
                    <li><span>1.1.</span> Использование материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации.</li>
                    <li><span>1.2.</span> Пользователь обязан полностью ознакомиться с настоящими Правилами до момента регистрации на Сайте. Регистрация Пользователя на Сайте означает полное и безоговорочное принятие Пользователем настоящих Правил в соответствии со ст. 438 Гражданского кодекса Российской Федерации.</li>
                    <li><span>1.3.</span> Администрация Сайта вправе в любое время в одностороннем порядке изменять условия настоящего Соглашения. Такие изменения вступают в силу по истечении 3 (Трех) дней с момента размещения новой версии Соглашения на сайте. При несогласии Пользователя с внесенными изменениями он обязан отказаться от доступа к Сайту, прекратить использование материалов и сервисов Сайта.</li>
                </ul>
                <h2>2. Обязанности Пользователя</h2>
                <ul>
                    <li><span>2.1.</span>Пользователю при использовании Сайта запрещается загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать любую информацию, которая:
                    </li>
                    <ul>
                        <li>
                            <span>2.1.1.</span> содержит угрозы, призывы к насилию, в том числе скрытые, одобрение и поощрение насильственных действий, дискредитирует, оскорбляет, порочит честь и достоинство или деловую репутацию или нарушает неприкосновенность частной жизни других Пользователей или третьих лиц;
                        </li>
                        <li><span>2.1.2.</span> нарушает права несовершеннолетних лиц;</li>
                        <li><span>2.1.3.</span> является вульгарной или непристойной, содержит порнографические изображения и тексты или сцены сексуального характера с участием несовершеннолетних;</li>
                        <li><span>2.1.4.</span> содержит сцены бесчеловечного обращения с животными;</li>
                        <li><span>2.1.5.</span> содержит описание средств и способов суицида, любое подстрекательство к его совершению;</li>
                        <li><span>2.1.6.</span> пропагандирует и/или способствует разжиганию расовой, религиозной, этнической ненависти или вражды, по признакам отнесения к определенным полу, ориентации, а также по иным индивидуальным признакам и особенностям человека (включая вопросы его здоровья);</li>
                        <li><span>2.1.7.</span> содержит экстремистские материалы;</li>
                        <li><span>2.1.8.</span> пропагандирует преступную деятельность или содержит советы, инструкции или руководства по совершению преступных действий;</li>
                        <li><span>2.1.9.</span> содержит информацию ограниченного доступа, включая, но не ограничиваясь, государственной и коммерческой тайной, информацией о частной жизни третьих лиц;</li>
                        <li><span>2.1.10.</span> содержит рекламу или описывает привлекательность употребления наркотических веществ, в том числе «цифровых наркотиков» (звуковых файлов, оказывающих воздействие на мозг человека за счет бинауральных ритмов), информацию о распространении наркотиков, рецепты их изготовления и советы по употреблению;</li>
                        <li><span>2.1.11.</span> потенциально может привести к совершению противоправных действий путем введения Пользователей в заблуждение или злоупотребления их доверием;</li>
                        <li><span>2.1.12.</span> а также нарушает иные права и интересы граждан и юридических лиц или требования законодательства Российской Федерации.</li>
                    </ul>
                    <li><span>2.2.</span> незаконно загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать интеллектуальную собственность Пользователей и третьих лиц;</li>
                    <li><span>2.3.</span> использовать без специального на то разрешения Администрации Сайта автоматизированные скрипты (программы, боты, краулеры) для сбора информации на Сайте и/или взаимодействия с Сайтом и его функционалом;</li>
                    <li><span>2.4.</span> осуществлять использование Сайта иным способом, кроме как через интерфейс, предоставленный Администрацией Сайта</li>
                    <li><span>2.5.</span> размещать любую другую информацию, которая, по личному мнению Администрации, является нежелательной, не соответствует целям создания Сайта, ущемляет интересы Пользователей или по другим причинам является нежелательной для размещения на Сайте;</li>
                    <li><span>2.6.</span> Пользователь несет личную ответственность за любую информацию, которую размещает на Сайте, сообщает другим Пользователям, а также за любые взаимодействия с другими Пользователями, осуществляемые на свой риск.</li>
                    <li><span>2.7.</span> Комментарии и иные записи Пользователя на Сайте не должны вступать в противоречие с требованиями законодательства Российской Федерации и общепринятых норм морали и нравственности.</li>
                    <li><span>2.8.</span> В случае несогласия Пользователя с настоящими Правилами или их обновлениями, Пользователь обязан отказаться от использования Сайта, проинформировав об этом Администрацию Сайта в установленном порядке.</li>
                </ul>
                <h2>3. Функционирование Сайта Musicamp и ответственность при его использовании</h2>
                <ul>
                    <li><span>3.1.</span> Пользователи несут ответственность за собственные действия в связи с созданием и размещением информации на собственной персональной странице на Сайте, а также в связи с размещением информации на персональных страницах других Пользователей и в иных разделах Сайта в соответствии с действующим законодательством Российской Федерации. Нарушение настоящих Правил и действующего законодательства Российской Федерации влечет за собой гражданско-правовую, административную и уголовную ответственность.</li>
                    <li><span>3.2.</span> Администрация Сайта предоставляет техническую возможность его использования Пользователями, не участвует в формировании содержания персональных страниц Пользователей и не контролирует и не несет ответственности за действия или бездействие любых лиц в отношении использования Сайта или формирования и использования содержания персональных страниц Пользователей на Сайте.</li>
                    <li><span>3.3.</span> Администрация сохраняет за собой право в любое время изменять оформление Сайта, его содержание, функционал, изменять или дополнять используемые скрипты, программное обеспечение и другие объекты, используемые или хранящиеся на Сайте, любые серверные приложения в любое время с предварительным уведомлением или без такового.</li>
                    <li><span>3.4.</span> Администрация Сайта не занимается предварительной модерацией или цензурой информации Пользователей и предпринимает действия по защите прав и интересов лиц и обеспечению соблюдения требований законодательства Российской Федерации только после обращения заинтересованного лица к Администрации Сайта в установленном порядке.</li>
                    <li><span>3.5.</span>  Администрация Сайта не несет ответственности за нарушение Пользователем настоящих Правил и оставляет за собой право по своему собственному усмотрению, а также при получении информации от других пользователей либо третьих лиц о нарушении Пользователем настоящих Правил, изменять (модерировать), блокировать или удалять любую публикуемую Пользователем информацию, нарушающую запреты, установленные настоящими Правилами, приостанавливать, ограничивать или прекращать доступ Пользователя ко всем или к любому из разделов или функционалу Сайта, исключать из системы поиска и/или заблокировать Сообщество в любое время по любой причине или без объяснения причин, с предварительным уведомлением или без такового. Администрация Сайта закрепляет за собой право удалить персональную страницу Пользователя и/или приостановить, ограничить или прекратить доступ Пользователя к любой из функциональных возможностей Сайта, если Администрация обнаружит, что по ее мнению, Пользователь представляет угрозу для Сайта и/или его Пользователей. Наряду с указанным в настоящем пункте выше Администрация Сайта вправе блокировать и/или удалять Приложения API, ограничивать доступ Пользователей к Приложения API, сайтам, приложениям третьих лиц, иным сторонним ресурсам, блокировать и/или удалять ссылки на них, в случае если у Администрации Сайта появятся основания полагать, что такие Приложения API, сайты, приложения третьих лиц, иные сторонние ресурсы представляют или могут представлять угрозу для нормальной работы Сайта и его Пользователей. Администрация Сайта реализует описанные выше меры в соответствии с применимым законодательством и не несет ответственности за возможные негативные последствия таких мер для Пользователя или третьих лиц.</li>
                    <li><span>3.6.</span> После удаления персональной страницы Пользователь теряет доступ к использованию Сайта. Удаление персональной страницы Пользователя означает автоматическое удаление всей информации, размещенной на ней, а также всей информации Пользователя, введенной при регистрации на Сайте.</li>
                    <li><span>3.7.</span> Ограничение ответственности Администрации Сайта:</li>
                    <ul>
                        <li><span>3.7.1.</span> САЙТ И ЕГО ФУНКЦИОНАЛ, ВКЛЮЧАЯ ВСЕ СКРИПТЫ, ПРИЛОЖЕНИЯ, КОНТЕНТ И ОФОРМЛЕНИЕ САЙТА ПОСТАВЛЯЮТСЯ «КАК ЕСТЬ». АДМИНИСТРАЦИЯ ОТКАЗЫВАЕТСЯ ОТ ВСЯКИХ ГАРАНТИЙ ТОГО, ЧТО САЙТ ИЛИ ЕГО ФУНКЦИОНАЛ МОГУТ ПОДХОДИТЬ ИЛИ НЕ ПОДХОДИТЬ ДЛЯ КОНКРЕТНЫХ ЦЕЛЕЙ ИСПОЛЬЗОВАНИЯ. АДМИНИСТРАЦИЯ НЕ МОЖЕТ ГАРАНТИРОВАТЬ И НЕ ОБЕЩАЕТ НИКАКИХ СПЕЦИФИЧЕСКИХ РЕЗУЛЬТАТОВ ОТ ИСПОЛЬЗОВАНИЯ САЙТА И/ИЛИ ЕГО ФУНКЦИОНАЛА;</li>
                        <li><span>3.7.2.</span> ВО ИЗБЕЖАНИЕ НЕДОРАЗУМЕНИЙ ПОЛЬЗОВАТЕЛЮ СЛЕДУЕТ СОБЛЮДАТЬ МЕРЫ ПРЕДОСТОРОЖНОСТИ В СКАЧИВАНИИ С САЙТА ИЛИ ПО РАЗМЕЩЕННЫМ НА НЕМ ССЫЛКАМ, И ИСПОЛЬЗОВАНИИ ЛЮБЫХ ФАЙЛОВ, В ТОМ ЧИСЛЕ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ. АДМИНИСТРАЦИЯ САЙТА НАСТОЯТЕЛЬНО РЕКОМЕНДУЕТ ИСПОЛЬЗОВАТЬ ТОЛЬКО ЛИЦЕНЗИОННОЕ, В ТОМ ЧИСЛЕ АНТИВИРУСНОЕ, ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ;</li>
                        <li><span>3.7.3.</span> ИСПОЛЬЗУЯ САЙТ, ПОЛЬЗОВАТЕЛЬ СОГЛАШАЕТСЯ С ТЕМ, ЧТО СКАЧИВАЕТ С САЙТА ИЛИ С ЕГО ПОМОЩЬЮ ЛЮБЫЕ МАТЕРИАЛЫ НА СВОЙ СОБСТВЕННЫЙ РИСК И НЕСЕТ ЛИЧНУЮ ОТВЕТСТВЕННОСТЬ ЗА ВОЗМОЖНЫЕ ПОСЛЕДСТВИЯ ИСПОЛЬЗОВАНИЯ УКАЗАННЫХ МАТЕРИАЛОВ, В ТОМ ЧИСЛЕ ЗА УЩЕРБ, КОТОРЫЙ ЭТО МОЖЕТ ПРИЧИНИТЬ КОМПЬЮТЕРУ ПОЛЬЗОВАТЕЛЯ ИЛИ ТРЕТЬИМ ЛИЦАМ, ЗА ПОТЕРЮ ДАННЫХ ИЛИ ЛЮБОЙ ДРУГОЙ ВРЕД;</li>
                        <li><span>3.7.4.</span> НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АДМИНИСТРАЦИЯ САЙТА ИЛИ ЕЕ ПРЕДСТАВИТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТЬ ПЕРЕД ПОЛЬЗОВАТЕЛЕМ ИЛИ ПЕРЕД ЛЮБЫМИ ТРЕТЬИМИ ЛИЦАМИ ЗА ЛЮБОЙ КОСВЕННЫЙ, СЛУЧАЙНЫЙ, НЕУМЫШЛЕННЫЙ УЩЕРБ, ВКЛЮЧАЯ УПУЩЕННУЮ ВЫГОДУ ИЛИ ПОТЕРЯННЫЕ ДАННЫЕ, ВРЕД ЧЕСТИ, ДОСТОИНСТВУ ИЛИ ДЕЛОВОЙ РЕПУТАЦИИ, ВЫЗВАННЫЙ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ САЙТА, СОДЕРЖИМОГО САЙТА ИЛИ ИНЫХ МАТЕРИАЛОВ, К КОТОРЫМ ВЫ ИЛИ ИНЫЕ ЛИЦА ПОЛУЧИЛИ ДОСТУП С ПОМОЩЬЮ САЙТА, ДАЖЕ ЕСЛИ АДМИНИСТРАЦИЯ САЙТА ПРЕДУПРЕЖДАЛА ИЛИ УКАЗЫВАЛА НА ВОЗМОЖНОСТЬ ТАКОГО ВРЕДА.</li>
                    </ul>
                                   </ul>
                <h2>4. Прочие условия</h2>
                <ul>
                    <li><span>4.1.</span> В случае возникновения любых споров или разногласий, связанных с исполнением настоящих Правил, Пользователь и Администрация Сайта приложат все усилия для их разрешения путем проведения переговоров между ними. В случае, если споры не будут разрешены путем переговоров, споры подлежат разрешению в порядке, установленном действующим законодательством Российской Федерации.</li>
                    <li><span>4.2.</span> Настоящие Правила вступают в силу для Пользователя с момента его присоединения к ним и действуют в течение неопределенного срока.</li>
                </ul>
                <h3>Регистрируясь и пользуясь сайтом, пользователь подтверждает, что ознакомлен со всеми пунктами настоящего Соглашения и безусловно принимает их.</h3>
                <p style="font-size: 14px">Если вы считаете, что ваши права были нарушены или по любому другому вопросу свяжитесь по адресу: <span style="font-weight: 700">musicamp@gmail.com</span></p>
            </div>

        </div>

    </main>
</template>

<script>

    import Header from '../components/Header'

    export default {
        name: "Terms",
        components:{Header}
    }
</script>

<style scoped>
    .main{
        display: flex;
        flex-direction: row;
        width: 1100px;
        margin: 60px auto auto auto;
    }
    .leftSide{
        background-color: #F9F9F9;
        padding: 20px 80px;
        width: 100%;
        margin-bottom: 80px;
    }
    h1, h2, h3{
        font-family: "Source Sans Pro";
        font-weight: 600;
    }
    ul li, p{
        font-family: "Open Sans";
        font-size: 17px;
        margin: 8px 0px;
    }
    li span{
        font-weight: 700;
    }
</style>